In [2]:
import pandas as pd

i = pd.DataFrame({"x":[5,10,15,20],"y":[101,202,303,404]})

j = pd.DataFrame({"x":[1,2,3],"y":[110,120,130,]})

i.append(j,)

    x    y
0   5  101
1  10  202
2  15  303
3  20  404
0   1  110
1   2  120
2   3  130

In [4]:
import pandas as pd

i = pd.DataFrame({"x":["jan","feb","mar","apr"],"y":[1,2,3,4]})

j = pd.DataFrame({"x":["z","y","x"],"y":[10,20,30]})

i.append(j,)

     x   y
0  jan   1
1  feb   2
2  mar   3
3  apr   4
0    z  10
1    y  20
2    x  30

In [7]:
import pandas as pd

i = pd.DataFrame({"a":["monday","tuesday","wednesday"],"p":[101,202,303]})

j = pd.DataFrame({"a":["abcd","efgh","ijkl","mnop"],"p":[10,20,30,40]})

i.append(j,)

           a    p
0     monday  101
1    tuesday  202
2  wednesday  303
0       abcd   10
1       efgh   20
2       ijkl   30
3       mnop   40

In [10]:
import pandas as pd

i = pd.DataFrame({"x":[10,20,30,40,50],"y":[101,102,103,104,105]})

j = pd.DataFrame({"x":[60,70,80],"y":[110,220,330]})

i.append(j,ignore_index=True)

    x    y
0  10  101
1  20  102
2  30  103
3  40  104
4  50  105
5  60  110
6  70  220
7  80  330

In [12]:
import pandas as pd
import numpy as np

i = pd.DataFrame({"person":["rubina","jasmin","sara","sonali"],"age":[16,38,6,43]})

i.count()

person    4
age       4
dtype: int64

In [16]:
import pandas as pd
import numpy as np

i = pd.DataFrame({"person":["julie","smith","virat","andy"],"age":[20,30,40,50]})

i.count()
i.count(axis='columns')

0    2
1    2
2    2
3    2
dtype: int64

In [21]:
import pandas as pd
import numpy as np

i = pd.DataFrame({"person":["abhinav","arjun","rahul","sham"],"age":[19,34,78,94],"city":["pune","nashik","np.nan","jaipur"]})

i.count()
i.count(axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [22]:
import pandas as pd
i = pd.DataFrame({'name':['andy','smith','juhie','sana'],'age':[18,56,38,9],'marks':[85,92,58,90],'grade':['a','a','c','d']})

file1 = pd.ExcelWriter('dataofuser.xlsx')

i.to_excel(file1)

file1.save()

print('Excel File Generated.')

Excel File Generated.

In [25]:
import pandas as pd

i = pd.read_csv("C:\\Users\\DELL\\Desktop\\lecture 04 student_results (1).csv")

i.head()

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75

In [28]:
import pandas as pd

i = {'no':pd.Series([100,200,300],index=['a','b','c']),
    'no1':pd.Series([111,222,333],index=['a1','b1','c1']),
    'no2':pd.Series([101,202,303],index=['a2','b2','c3'])
     
    }

d1 = pd.DataFrame(i)

print(d1)

       no    no1    no2
a   100.0    NaN    NaN
a1    NaN  111.0    NaN
a2    NaN    NaN  101.0
b   200.0    NaN    NaN
b1    NaN  222.0    NaN
b2    NaN    NaN  202.0
c   300.0    NaN    NaN
c1    NaN  333.0    NaN
c3    NaN    NaN  303.0

In [30]:
import pandas as pd

i = {'no':[1,2,3,4],'name':['juhie','sandy','manju','rutu'],'city':['pune','mumbai','nashik','nagar']}

df = pd.DataFrame(i)

print(df)

   no   name    city
0   1  juhie    pune
1   2  sandy  mumbai
2   3  manju  nashik
3   4   rutu   nagar

In [31]:
import pandas as pd

i = ["jan","feb","mar","apr","may",17,56.8,34,70.6]

df = pd.DataFrame(i)

print(df)

      0
0   jan
1   feb
2   mar
3   apr
4   may
5    17
6  56.8
7    34
8  70.6